# Author: Tullie Murrell (tulliemurrell@gmail.com)
#
# brew bundle --file=Brewfile
# Homebrew runs on both macOS and Linux, so this file is shared by
# install_mac.sh and install_linux.sh.

# Shell / core
brew "git"
brew "git-lfs"
brew "tmux"
brew "neovim"
brew "node"
brew "tree-sitter-cli"

# Search / navigation
brew "fzf"
brew "ripgrep"
brew "fd"
brew "zoxide"

# Modern CLI replacements
brew "eza"
brew "bat"
brew "git-delta"

# Prompt / shell history / env
brew "starship"
brew "atuin"
brew "direnv"
brew "mise"

# GitHub
brew "gh"
